var Constants = { };

Constants.QUEST_TYPE_STR = [ '不明', '編成', '出撃', '演習', '遠征', '整備', '工廠', '改装' ];
Constants.QUEST_TYPE_COLOR = [ 'rgba(0, 0, 0, 0)', '#3EBA2B', '#B32034', '#5EC84E', '#44A5CB', '#CCB800', '#6E331C', '#C35B9D' ];

Constants.ENSEI = {
	1: '練習航海',
	2: '長距離練習航海',
	3: '警備任務',
	4: '対潜警戒任務',
	5: '海上護衛任務',
	6: '防空射撃演習',
	7: '観艦式予行',
	8: '観艦式',
	9: 'タンカー護衛任務',
	10: '強行偵察任務',
	11: 'ボーキサイト輸送任務',
	12: '資源輸送任務',
	13: '鼠輸送作戦',
	14: '包囲陸戦隊撤収作戦',
	15: '囮機動部隊支援作戦',
	16: '艦隊決戦援護作戦',
	17: '敵地偵察作戦',
	18: '航空機輸送作戦',
	19: '北号作戦',
	20: '潜水艦哨戒任務',
	21: '北方鼠輸送作戦',
	22: '艦隊演習',
	23: '航空戦艦運用演習',
	25: '通商破壊作戦',
	26: '敵母港空襲作戦',
	27: '潜水艦通商破壊作戦',
	28: '西方海域封鎖作戦',
	29: '潜水艦派遣演習',
	30: '潜水艦派遣作戦',
	31: '海外艦との接触',
	33: '前衛支援任務',
	34: '前衛決戦支援任務',
	35: 'ＭＯ作戦',
	36: '水上機基地建設',
	37: '東京急行',
	38: '東京急行(弐)'
};